poetryapp/app/controllers/poems_controller.rb

SELECT "poems".* FROM "poems"
---
  def index
    @poems = Poem.all

INSERT INTO "poems" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2018-06-04 01:01:07.189599"], ["updated_at", "2018-06-04 01:01:07.189599"]]
---
  def create
    @poem = Poem.new(poem_params)

    if @poem.save

SELECT  "poems".* FROM "poems" WHERE "poems"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def set_poem
      @poem = Poem.find(params[:id])